import{j as s,y as x,L as c,H as e,S as i,B as r}from"./index-pQZNF0D4.js";const n=()=>s.jsxs("svg",{version:"1.1",id:"Capa_1",x:"0px",y:"0px",width:"55.5px",height:"55.5px",viewBox:"0 0 535.5 535.5",children:[s.jsx("g",{children:s.jsxs("g",{children:[s.jsx("path",{d:`M162.9,198.9v-22.95c-22.95-15.3-38.25-42.075-38.25-70.763c0-47.812,38.25-86.062,86.062-86.062\r
			c47.812,0,86.062,38.25,86.062,86.062c0,17.212-5.737,34.425-15.3,47.812c1.913,0,3.825,0,5.737,0c5.738,0,11.476,0,15.301,1.913\r
			c7.649-15.3,13.387-32.513,13.387-49.725C315.9,47.812,268.087,0,210.713,0c-57.375,0-105.188,47.812-105.188,105.188\r
			C105.525,145.35,128.475,181.688,162.9,198.9z`}),s.jsx("path",{d:`M277.65,105.188c0-36.337-30.6-66.938-66.937-66.938s-66.938,30.6-66.938,66.938c0,19.125,7.65,34.425,19.125,45.9v-45.9\r
			c0-26.775,21.038-47.812,47.812-47.812s47.812,21.038,47.812,47.812v45.9C270,139.612,277.65,124.312,277.65,105.188z`}),s.jsx("path",{d:`M440.212,210.375c-15.3,0-28.688,13.388-28.688,28.688v42.075v5.737H392.4v-43.987v-22.95\r
			c0-15.3-13.387-28.688-28.688-28.688c-15.3,0-28.688,13.388-28.688,28.688v19.125v28.688H315.9v-28.688v-38.25\r
			c0-15.3-13.387-28.688-28.688-28.688c-15.3,0-28.688,13.388-28.688,28.688v36.337v49.725H239.4v-47.812V105.188\r
			c0-15.3-13.388-28.688-28.688-28.688c-15.3,0-28.688,13.388-28.688,28.688v196.987c-40.163-42.075-91.8-87.975-112.837-66.938\r
			C48.15,256.275,103.613,313.65,178.2,439.875c34.425,57.375,76.5,95.625,149.175,95.625c78.412,0,143.438-65.025,143.438-143.438\r
			V328.95v-89.888C468.9,223.763,455.513,210.375,440.212,210.375z`})]})}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{}),s.jsx("g",{})]}),j=x.article`
  display: flex;
  flex-direction: column;
  column-gap: 50px;
  font-size: 1.5rem;

  hr {
    width: 100%;
  }

  time {
    font-size: 4rem;
    text-shadow: 0px 0px 22px #000;
  }

  div, a {
    margin: 0 auto;
    text-align: center;
  }

  a:hover {
    text-shadow: 2px 2px 2px #000;
    background-color: #00000011;
  }
  
`,t=()=>s.jsxs(c,{children:[s.jsx(e,{}),s.jsx(i,{$height:"100vh",$padding:"20px",children:s.jsxs(j,{children:[s.jsxs("div",{children:[s.jsx("div",{children:"Выездная регистрация начнётся в"}),s.jsx("time",{children:"17:00"})]}),s.jsx("hr",{}),s.jsxs("div",{children:[s.jsx("p",{children:"Адрес:"}),s.jsxs("address",{children:["Республика Башкортостан, Кушнаренковский район, ",s.jsx("br",{}),"Старокамышлинский сельсовет, деревня Ильмурзино"]})]}),s.jsx("hr",{}),s.jsxs(r,{to:"/location",children:[s.jsx("div",{children:"Посмотреть на карте "}),s.jsx("div",{children:s.jsx(n,{})})]})]})})]});export{t as default};
